MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F205RB/mcu.h
/* Legacy defines */
#define GPIO_IDR_IDR_0                      GPIO_IDR_ID0
#define GPIO_IDR_IDR_1                      GPIO_IDR_ID1
#define GPIO_IDR_IDR_2                      GPIO_IDR_ID2
#define GPIO_IDR_IDR_3                      GPIO_IDR_ID3
#define GPIO_IDR_IDR_4                      GPIO_IDR_ID4
#define GPIO_IDR_IDR_5                      GPIO_IDR_ID5
#define GPIO_IDR_IDR_6                      GPIO_IDR_ID6
#define GPIO_IDR_IDR_7                      GPIO_IDR_ID7
#define GPIO_IDR_IDR_8                      GPIO_IDR_ID8
#define GPIO_IDR_IDR_9                      GPIO_IDR_ID9
#define GPIO_IDR_IDR_10                     GPIO_IDR_ID10
#define GPIO_IDR_IDR_11                     GPIO_IDR_ID11
#define GPIO_IDR_IDR_12                     GPIO_IDR_ID12
#define GPIO_IDR_IDR_13                     GPIO_IDR_ID13
#define GPIO_IDR_IDR_14                     GPIO_IDR_ID14
#define GPIO_IDR_IDR_15                     GPIO_IDR_ID15

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_OD0                        0x00000001U
#define GPIO_ODR_OD1                        0x00000002U
#define GPIO_ODR_OD2                        0x00000004U
#define GPIO_ODR_OD3                        0x00000008U
#define GPIO_ODR_OD4                        0x00000010U
#define GPIO_ODR_OD5                        0x00000020U
#define GPIO_ODR_OD6                        0x00000040U
#define GPIO_ODR_OD7                        0x00000080U
#define GPIO_ODR_OD8                        0x00000100U
#define GPIO_ODR_OD9                        0x00000200U
#define GPIO_ODR_OD10                       0x00000400U
#define GPIO_ODR_OD11                       0x00000800U
#define GPIO_ODR_OD12                       0x00001000U
#define GPIO_ODR_OD13                       0x00002000U
#define GPIO_ODR_OD14                       0x00004000U
#define GPIO_ODR_OD15                       0x00008000U

/* Legacy defines */
#define GPIO_ODR_ODR_0                      GPIO_ODR_OD0
#define GPIO_ODR_ODR_1                      GPIO_ODR_OD1
#define GPIO_ODR_ODR_2                      GPIO_ODR_OD2
#define GPIO_ODR_ODR_3                      GPIO_ODR_OD3
#define GPIO_ODR_ODR_4                      GPIO_ODR_OD4
#define GPIO_ODR_ODR_5                      GPIO_ODR_OD5
#define GPIO_ODR_ODR_6                      GPIO_ODR_OD6
#define GPIO_ODR_ODR_7                      GPIO_ODR_OD7
#define GPIO_ODR_ODR_8                      GPIO_ODR_OD8
#define GPIO_ODR_ODR_9                      GPIO_ODR_OD9
#define GPIO_ODR_ODR_10                     GPIO_ODR_OD10
#define GPIO_ODR_ODR_11                     GPIO_ODR_OD11
#define GPIO_ODR_ODR_12                     GPIO_ODR_OD12
#define GPIO_ODR_ODR_13                     GPIO_ODR_OD13
#define GPIO_ODR_ODR_14                     GPIO_ODR_OD14
#define GPIO_ODR_ODR_15                     GPIO_ODR_OD15

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS0                       0x00000001U
#define GPIO_BSRR_BS1                       0x00000002U
#define GPIO_BSRR_BS2                       0x00000004U
#define GPIO_BSRR_BS3                       0x00000008U
#define GPIO_BSRR_BS4                       0x00000010U
#define GPIO_BSRR_BS5                       0x00000020U
#define GPIO_BSRR_BS6                       0x00000040U
#define GPIO_BSRR_BS7                       0x00000080U
#define GPIO_BSRR_BS8                       0x00000100U
#define GPIO_BSRR_BS9                       0x00000200U
#define GPIO_BSRR_BS10                      0x00000400U
#define GPIO_BSRR_BS11                      0x00000800U
#define GPIO_BSRR_BS12                      0x00001000U
#define GPIO_BSRR_BS13                      0x00002000U
#define GPIO_BSRR_BS14                      0x00004000U
#define GPIO_BSRR_BS15                      0x00008000U
#define GPIO_BSRR_BR0                       0x00010000U
#define GPIO_BSRR_BR1                       0x00020000U
#define GPIO_BSRR_BR2                       0x00040000U
#define GPIO_BSRR_BR3                       0x00080000U
#define GPIO_BSRR_BR4                       0x00100000U
#define GPIO_BSRR_BR5                       0x00200000U
#define GPIO_BSRR_BR6                       0x00400000U
#define GPIO_BSRR_BR7                       0x00800000U
#define GPIO_BSRR_BR8                       0x01000000U
#define GPIO_BSRR_BR9                       0x02000000U
#define GPIO_BSRR_BR10                      0x04000000U
#define GPIO_BSRR_BR11                      0x08000000U
#define GPIO_BSRR_BR12                      0x10000000U
#define GPIO_BSRR_BR13                      0x20000000U
#define GPIO_BSRR_BR14                      0x40000000U
#define GPIO_BSRR_BR15                      0x80000000U

/* Legacy defines */
#define GPIO_BSRR_BS_0                      GPIO_BSRR_BS0
#define GPIO_BSRR_BS_1                      GPIO_BSRR_BS1
#define GPIO_BSRR_BS_2                      GPIO_BSRR_BS2
#define GPIO_BSRR_BS_3                      GPIO_BSRR_BS3
#define GPIO_BSRR_BS_4                      GPIO_BSRR_BS4
#define GPIO_BSRR_BS_5                      GPIO_BSRR_BS5
#define GPIO_BSRR_BS_6                      GPIO_BSRR_BS6
#define GPIO_BSRR_BS_7                      GPIO_BSRR_BS7
#define GPIO_BSRR_BS_8                      GPIO_BSRR_BS8
#define GPIO_BSRR_BS_9                      GPIO_BSRR_BS9
#define GPIO_BSRR_BS_10                     GPIO_BSRR_BS10
#define GPIO_BSRR_BS_11                     GPIO_BSRR_BS11
#define GPIO_BSRR_BS_12                     GPIO_BSRR_BS12
#define GPIO_BSRR_BS_13                     GPIO_BSRR_BS13
#define GPIO_BSRR_BS_14                     GPIO_BSRR_BS14
#define GPIO_BSRR_BS_15                     GPIO_BSRR_BS15
#define GPIO_BSRR_BR_0                      GPIO_BSRR_BR0
#define GPIO_BSRR_BR_1                      GPIO_BSRR_BR1
#define GPIO_BSRR_BR_2                      GPIO_BSRR_BR2
#define GPIO_BSRR_BR_3                      GPIO_BSRR_BR3
#define GPIO_BSRR_BR_4                      GPIO_BSRR_BR4
#define GPIO_BSRR_BR_5                      GPIO_BSRR_BR5
#define GPIO_BSRR_BR_6                      GPIO_BSRR_BR6
#define GPIO_BSRR_BR_7                      GPIO_BSRR_BR7
#define GPIO_BSRR_BR_8                      GPIO_BSRR_BR8
#define GPIO_BSRR_BR_9                      GPIO_BSRR_BR9
#define GPIO_BSRR_BR_10                     GPIO_BSRR_BR10
#define GPIO_BSRR_BR_11                     GPIO_BSRR_BR11
#define GPIO_BSRR_BR_12                     GPIO_BSRR_BR12
#define GPIO_BSRR_BR_13                     GPIO_BSRR_BR13
#define GPIO_BSRR_BR_14                     GPIO_BSRR_BR14
#define GPIO_BSRR_BR_15                     GPIO_BSRR_BR15

/****************** Bit definition for GPIO_LCKR register *********************/
#define GPIO_LCKR_LCK0_Pos          (0U)                                       
#define GPIO_LCKR_LCK0_Msk          (0x1UL << GPIO_LCKR_LCK0_Pos)               /*!< 0x00000001 */
#define GPIO_LCKR_LCK0              GPIO_LCKR_LCK0_Msk                         
#define GPIO_LCKR_LCK1_Pos          (1U)                                       
#define GPIO_LCKR_LCK1_Msk          (0x1UL << GPIO_LCKR_LCK1_Pos)               /*!< 0x00000002 */
#define GPIO_LCKR_LCK1              GPIO_LCKR_LCK1_Msk                         
#define GPIO_LCKR_LCK2_Pos          (2U)                                       
#define GPIO_LCKR_LCK2_Msk          (0x1UL << GPIO_LCKR_LCK2_Pos)               /*!< 0x00000004 */
#define GPIO_LCKR_LCK2              GPIO_LCKR_LCK2_Msk                         
#define GPIO_LCKR_LCK3_Pos          (3U)                                       
#define GPIO_LCKR_LCK3_Msk          (0x1UL << GPIO_LCKR_LCK3_Pos)               /*!< 0x00000008 */
#define GPIO_LCKR_LCK3              GPIO_LCKR_LCK3_Msk                         
#define GPIO_LCKR_LCK4_Pos          (4U)                                       
#define GPIO_LCKR_LCK4_Msk          (0x1UL << GPIO_LCKR_LCK4_Pos)               /*!< 0x00000010 */
#define GPIO_LCKR_LCK4              GPIO_LCKR_LCK4_Msk                         
#define GPIO_LCKR_LCK5_Pos          (5U)                                       
#define GPIO_LCKR_LCK5_Msk          (0x1UL << GPIO_LCKR_LCK5_Pos)               /*!< 0x00000020 */
#define GPIO_LCKR_LCK5              GPIO_LCKR_LCK5_Msk                         
#define GPIO_LCKR_LCK6_Pos          (6U)                                       
#define GPIO_LCKR_LCK6_Msk          (0x1UL << GPIO_LCKR_LCK6_Pos)               /*!< 0x00000040 */
#define GPIO_LCKR_LCK6              GPIO_LCKR_LCK6_Msk                         
#define GPIO_LCKR_LCK7_Pos          (7U)                                       
#define GPIO_LCKR_LCK7_Msk          (0x1UL << GPIO_LCKR_LCK7_Pos)               /*!< 0x00000080 */
#define GPIO_LCKR_LCK7              GPIO_LCKR_LCK7_Msk                         
#define GPIO_LCKR_LCK8_Pos          (8U)                                       
#define GPIO_LCKR_LCK8_Msk          (0x1UL << GPIO_LCKR_LCK8_Pos)               /*!< 0x00000100 */
#define GPIO_LCKR_LCK8              GPIO_LCKR_LCK8_Msk                         
#define GPIO_LCKR_LCK9_Pos          (9U)                                       
#define GPIO_LCKR_LCK9_Msk          (0x1UL << GPIO_LCKR_LCK9_Pos)               /*!< 0x00000200 */
#define GPIO_LCKR_LCK9              GPIO_LCKR_LCK9_Msk                         
#define GPIO_LCKR_LCK10_Pos         (10U)                                      
#define GPIO_LCKR_LCK10_Msk         (0x1UL << GPIO_LCKR_LCK10_Pos)              /*!< 0x00000400 */
#define GPIO_LCKR_LCK10             GPIO_LCKR_LCK10_Msk                        
#define GPIO_LCKR_LCK11_Pos         (11U)                                      
#define GPIO_LCKR_LCK11_Msk         (0x1UL << GPIO_LCKR_LCK11_Pos)              /*!< 0x00000800 */
#define GPIO_LCKR_LCK11             GPIO_LCKR_LCK11_Msk                        
#define GPIO_LCKR_LCK12_Pos         (12U)                                      
#define GPIO_LCKR_LCK12_Msk         (0x1UL << GPIO_LCKR_LCK12_Pos)              /*!< 0x00001000 */
#define GPIO_LCKR_LCK12             GPIO_LCKR_LCK12_Msk                        
#define GPIO_LCKR_LCK13_Pos         (13U)                                      
#define GPIO_LCKR_LCK13_Msk         (0x1UL << GPIO_LCKR_LCK13_Pos)              /*!< 0x00002000 */
#define GPIO_LCKR_LCK13             GPIO_LCKR_LCK13_Msk                        
#define GPIO_LCKR_LCK14_Pos         (14U)                                      
#define GPIO_LCKR_LCK14_Msk         (0x1UL << GPIO_LCKR_LCK14_Pos)              /*!< 0x00004000 */
#define GPIO_LCKR_LCK14             GPIO_LCKR_LCK14_Msk                        
#define GPIO_LCKR_LCK15_Pos         (15U)                                      
#define GPIO_LCKR_LCK15_Msk         (0x1UL << GPIO_LCKR_LCK15_Pos)              /*!< 0x00008000 */
#define GPIO_LCKR_LCK15             GPIO_LCKR_LCK15_Msk                        
#define GPIO_LCKR_LCKK_Pos          (16U)                                      
#define GPIO_LCKR_LCKK_Msk          (0x1UL << GPIO_LCKR_LCKK_Pos)               /*!< 0x00010000 */
#define GPIO_LCKR_LCKK              GPIO_LCKR_LCKK_Msk                         

